perkowitz/hachi-yaeltex/hardware-def/yaeltex/samd/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

kilomux.name=Yaeltex Kilomux
kilomux.vid.0=0x2342
kilomux.pid.0=0x3000
kilomux.vid.1=0x2342
kilomux.pid.1=0x3001
kilomux.upload.tool=bossac
kilomux.upload.protocol=sam-ba
kilomux.upload.maximum_size=262144
kilomux.upload.use_1200bps_touch=true
kilomux.upload.wait_for_upload_port=true
kilomux.upload.native_usb=true
kilomux.build.mcu=cortex-m0plus
kilomux.build.f_cpu=48000000L
kilomux.build.usb_product="KilomuxV2"
kilomux.build.usb_manufacturer="Yaeltex"
kilomux.build.board=SAMD_ZERO
kilomux.build.core=arduino
kilomux.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
kilomux.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
kilomux.build.openocdscript=openocd_scripts/arduino_zero.cfg
kilomux.build.variant=kilomux
kilomux.build.variant_system_lib=
kilomux.build.extra_combine_flags=
kilomux.build.vid=0x2341
kilomux.build.pid=0x1000
kilomux.bootloader.tool=openocd
kilomux.bootloader.file=zero\samd21_sam_ba.bin

kilomux-test.name=Yaeltex Kilomux (test)
kilomux-test.vid.0=0x2342
kilomux-test.pid.0=0x3002
kilomux-test.vid.1=0x2342
kilomux-test.pid.1=0x3003
kilomux-test.upload.tool=bossac
kilomux-test.upload.protocol=sam-ba
kilomux-test.upload.maximum_size=262144
kilomux-test.upload.use_1200bps_touch=true
kilomux-test.upload.wait_for_upload_port=true
kilomux-test.upload.native_usb=true
kilomux-test.build.mcu=cortex-m0plus
kilomux-test.build.f_cpu=48000000L
kilomux-test.build.usb_product="KilomuxV2"
kilomux-test.build.usb_manufacturer="Yaeltex"
kilomux-test.build.board=SAMD_ZERO
kilomux-test.build.core=arduino
kilomux-test.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
kilomux-test.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
kilomux-test.build.openocdscript=openocd_scripts/arduino_zero.cfg
kilomux-test.build.variant=kilomux-test
kilomux-test.build.variant_system_lib=
kilomux-test.build.extra_combine_flags=
kilomux-test.build.vid=0x2341
kilomux-test.build.pid=0x1000
kilomux-test.bootloader.tool=openocd
kilomux-test.bootloader.file=zero\samd21_sam_ba.bin

